wayne-love/sn_esp32/src/main.cpp
}

#pragma endregion

#pragma region MQTT Publish / Subscribe

void mqttPublishStatusString(String s){

  mqttClient.publish(String(mqttBase+"rfResponse").c_str(),s.c_str());

}

bool generateStatusJson(String &output) {

  JsonDocument json;

  json["watertemperature"] = String(si.getWTMP() / 10) + "." + String(si.getWTMP() % 10); //avoids stupid rounding errors
  json["heatertemperature"] = String(si.getHeaterTemperature() / 10) + "." + String(si.getHeaterTemperature() % 10); //avoids stupid rounding errors
  json["casetemperature"] = String(si.getCaseTemperature()); //avoids stupid rounding errors
  json["voltage"]=String(si.getMainsVoltage());
  json["current"]=String(si.getMainsCurrent() / 10) + "." + String(si.getMainsCurrent() % 10);
  json["power"]=String(si.getPower() / 10) + "." + String(si.getPower() % 10);
  json["heatingactive"]=si.getRB_TP_Heater()? "ON": "OFF";
  json["ozoneactive"]=si.getRB_TP_Ozone()? "ON": "OFF";
  json["totalenergy"]=String(si.getPower_kWh() * 10); // convert to kWh to Wh.
  json["hpambtemp"]=String(si.getHP_Ambient());
  json["hpcondtemp"]=String(si.getHP_Condensor());
  json["temperaturesetpoint"]=String(si.getSTMP() / 10) + "." + String(si.getSTMP() % 10);
  json["heatermode"]=si.HPMPStrings[si.getHPMP()];

  json["pump1"]=si.getRB_TP_Pump1()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump2"]=si.getRB_TP_Pump2()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump3"]=si.getRB_TP_Pump3()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump4"]=si.getRB_TP_Pump4()==0? "OFF" : "ON"; // we're ignoring auto here
  json["pump5"]=si.getRB_TP_Pump5()==0? "OFF" : "ON"; // we're ignoring auto here


  String y=String(year(si.getSpaTime()));
  String m=String(month(si.getSpaTime()));
  if (month(si.getSpaTime())<10) m = "0"+m;
  String d=String(day(si.getSpaTime()));
  if (day(si.getSpaTime())<10) d = "0"+d;
  String h=String(hour(si.getSpaTime()));
  if (hour(si.getSpaTime())<10) h = "0"+h;
  String min=String(minute(si.getSpaTime()));
  if (minute(si.getSpaTime())<10) min = "0"+min;
  String s=String(second(si.getSpaTime()));
  if (second(si.getSpaTime())<10) s = "0"+s;

  json["datetime"]=y+"-"+m+"-"+d+" "+h+":"+min+":"+s;

  json["auxheat"]=si.getHELE()==0? "OFF" : "ON";

  json["status"]=si.getStatus();

  json["blower"] = si.getOutlet_Blower()==2? "OFF" : "ON";
  json["blowermode"] = si.getOutlet_Blower()==1? "Ramp" : "Variable";
  json["blowerspeed"] = si.getOutlet_Blower() ==2? "0" : String(si.getVARIValue());

  for (int count = 0; count < sizeof(si.sleepCodeMap); count++){
    if (si.sleepCodeMap[count] == si.getL_1SNZ_DAY())
      json["sleepTimers"]["one"]["state"]=si.sleepStringMap[count];
    if (si.sleepCodeMap[count] == si.getL_2SNZ_DAY())
      json["sleepTimers"]["two"]["state"]=si.sleepStringMap[count];
  }
  json["sleepTimers"]["one"]["begin"]=convertToTime(si.getL_1SNZ_BGN());
  json["sleepTimers"]["one"]["end"]=convertToTime(si.getL_1SNZ_END());
  json["sleepTimers"]["two"]["begin"]=convertToTime(si.getL_2SNZ_BGN());
  json["sleepTimers"]["two"]["end"]=convertToTime(si.getL_2SNZ_END());

  json["info"]["spaMode"]=si.getMode();

  json["lights"]["speed"]=si.getLSPDValue();
  json["lights"]["state"]=si.getRB_TP_Light()? "ON": "OFF";
  json["lights"]["effect"] = si.colorModeStrings[si.getColorMode()];
  json["lights"]["brightness"] = si.getLBRTValue();

  // 0 = white, if white, then set the hue and saturation to white so the light displays correctly in HA.
  if (si.getColorMode() == 0) {
    json["lights"]["color"]["h"] = 0;
    json["lights"]["color"]["s"] = 0;
  } else {
    int hue = 4;
    for (int count = 0; count < sizeof(si.colorMap); count++){
      if (si.colorMap[count] == si.getCurrClr()) {
        hue = count * 15;
      }
    }
    json["lights"]["color"]["h"] = hue;
    json["lights"]["color"]["s"] = 100;
  }
  json["lights"]["color_mode"] = "hs";

  if (serializeJson(json, output) == 0) {
    // Serialization failed
    return false;
  }
  return true;
}

void mqttPublishStatus() {
  String json;
  if (generateStatusJson(json)) {
    mqttClient.publish(mqttStatusTopic.c_str(),json.c_str());
  } else {
    debugD("Error generating json");
  }
}


void mqttCallback(char* topic, byte* payload, unsigned int length) {
  String t = String(topic);

  String p = "";
  for (int x = 0; x < length; x++) {
    p += char(*payload);
    payload++;
  }

  debugD("MQTT subscribe received '%s' with payload '%s'",topic,p.c_str());

  String property = t.substring(t.lastIndexOf("/")+1);

  debugI("Received update for %s to %s",property.c_str(),p.c_str());

  if (property == "temperature") {
    si.setSTMP(int(p.toFloat()*10));
  } else if (property == "heatpumpmode") {
    si.setHPMP(p);
  } else if (property == "pump1") {
    si.setRB_TP_Pump1(p=="OFF"?0:1);
  } else if (property == "pump2") {
    si.setRB_TP_Pump2(p=="OFF"?0:1);
  } else if (property == "pump3") { 
    si.setRB_TP_Pump3(p=="OFF"?0:1);
  } else if (property == "pump4") {
    si.setRB_TP_Pump4(p=="OFF"?0:1);
  } else if (property == "pump5") {
    si.setRB_TP_Pump5(p=="OFF"?0:1);
  } else if (property == "auxheat") {
    si.setHELE(p=="OFF"?0:1);
  } else if (property == "datetime") {
    tmElements_t tm;
    tm.Year=CalendarYrToTm(p.substring(0,4).toInt());
    tm.Month=p.substring(5,7).toInt();
    tm.Day=p.substring(8,10).toInt();
    tm.Hour=p.substring(11,13).toInt();
    tm.Minute=p.substring(14,16).toInt();
    tm.Second=p.substring(17).toInt();
    si.setSpaTime(makeTime(tm));
  } else if (property == "lights_state") {
    si.setRB_TP_Light(p=="ON"?1:0);
  } else if (property == "lights_effect") {
    si.setColorMode(p);
  } else if (property == "lights_brightness") {
    si.setLBRTValue(p.toInt());
  } else if (property == "lights_color") {
    int pos = p.indexOf(',');
    if ( pos > 0) {
      int value = p.substring(0, pos).toInt();
      si.setCurrClr(si.colorMap[value/15]);
    }
  } else if (property == "lights_speed") {
    si.setLSPDValue(p);
  } else if (property == "blower") {
    si.setOutlet_Blower(p=="OFF"?2:0);
  } else if (property == "blowerspeed") {
    if (p=="0") si.setOutlet_Blower(2);
    else si.setVARIValue(p.toInt());
  } else if (property == "blowermode") {
    si.setOutlet_Blower(p=="Variable"?0:1);
  } else if (property == "sleepTimers_1_state" || property == "sleepTimers_2_state") {
    for (int count = 0; count < sizeof(si.sleepStringMap); count++){
      if (si.sleepStringMap[count] == p) {
        if (property == "sleepTimers_1_state")
          si.setL_1SNZ_DAY(si.sleepCodeMap[count]);
        else if (property == "sleepTimers_2_state")
          si.setL_2SNZ_DAY(si.sleepCodeMap[count]);
      }
    }
  } else if (property == "sleepTimers_1_begin") {
    si.setL_1SNZ_BGN(convertToInteger(p));
  } else if (property == "sleepTimers_1_end") {
    si.setL_1SNZ_END(convertToInteger(p));
  } else if (property == "sleepTimers_2_begin") {
    si.setL_2SNZ_BGN(convertToInteger(p));
  } else if (property == "sleepTimers_2_end") {
    si.setL_2SNZ_END(convertToInteger(p));
  } else if (property == "info_spaMode") {
    si.setMode(p);
  } else {
    debugE("Unhandled property - %s",property.c_str());
  }
}


#pragma endregion

void setup() {
#if defined(EN_PIN)
  pinMode(EN_PIN, INPUT_PULLUP);
#endif

#if !defined(ESP8266)
  Serial.begin(115200);
  Serial.setDebugOutput(true);
#endif

